mafeiGitHub/stm32Mp3/Bsp/stm32F7_disco_audio.c
/*{{{*/
/**
	******************************************************************************
	* @file    stm32746g_discovery_audio.c
	* @date    25-June-2015
			 + This driver supports STM32F7xx devices on STM32746G-Discovery (MB1191) board.
			 + Call the function BSP_AUDIO_OUT_Init(
																				OutputDevice: physical output mode (OUTPUT_DEVICE_SPEAKER,
																											OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH)
																				Volume      : Initial volume to be set (0 is min (mute), 100 is max (100%)
																				AudioFreq   : Audio frequency in Hz (8000, 16000, 22500, 32000...)
																											this parameter is relative to the audio file/stream type.
																			 )
					This function configures all the hardware required for the audio application (codec, I2C, SAI,
					GPIOs, DMA and interrupt if needed). This function returns AUDIO_OK if configuration is OK.
					If the returned value is different from AUDIO_OK or the function is stuck then the communication with
					the codec or the MFX has failed (try to un-plug the power or reset device in this case).
					- OUTPUT_DEVICE_SPEAKER  : only speaker will be set as output for the audio stream.
					- OUTPUT_DEVICE_HEADPHONE: only headphones will be set as output for the audio stream.
					- OUTPUT_DEVICE_BOTH     : both Speaker and Headphone are used as outputs for the audio stream
																		 at the same time.
					Note. On STM32746G-Discovery SAI_DMA is configured in CIRCULAR mode. Due to this the application
						does NOT need to call BSP_AUDIO_OUT_ChangeBuffer() to assure streaming.
			 + Call the function BSP_DISCOVERY_AUDIO_OUT_Play(
																			pBuffer: pointer to the audio data file address
																			Size   : size of the buffer to be sent in Bytes
																		 )
					to start playing (for the first time) from the audio file/stream.
			 + Call the function BSP_AUDIO_OUT_Pause() to pause playing
			 + Call the function BSP_AUDIO_OUT_Resume() to resume playing.
					 Note. After calling BSP_AUDIO_OUT_Pause() function for pause, only BSP_AUDIO_OUT_Resume() should be called
							for resume (it is not allowed to call BSP_AUDIO_OUT_Play() in this case).
					 Note. This function should be called only when the audio file is played or paused (not stopped).
			 + For each mode, you may need to implement the relative callback functions into your code.
					The Callback functions are named AUDIO_OUT_XXX_CallBack() and only their prototypes are declared in
					the stm32746g_discovery_audio.h file. (refer to the example for more details on the callbacks implementations)
			 + To Stop playing, to modify the volume level, the frequency, the audio frame slot,
					the device output mode the mute or the stop, use the functions: BSP_AUDIO_OUT_SetVolume(),
					AUDIO_OUT_SetFrequency(), BSP_AUDIO_OUT_SetAudioFrameSlot(), BSP_AUDIO_OUT_SetOutputMode(),
					BSP_AUDIO_OUT_SetMute() and BSP_AUDIO_OUT_Stop().
			 + The driver API and the callback functions are at the end of the stm32746g_discovery_audio.h file.
		--------------------
			 + This driver provides the High Audio Layer: consists of the function API exported in the stm32746g_discovery_audio.h file
				 (BSP_AUDIO_OUT_Init(), BSP_AUDIO_OUT_Play() ...)
			 + This driver provide also the Media Access Layer (MAL): which consists of functions allowing to access the media containing/
				 providing the audio file/stream. These functions are also included as local functions into
				 the stm32746g_discovery_audio_codec.c file (SAIx_Out_Init() and SAIx_Out_DeInit(), SAIx_In_Init() and SAIx_In_DeInit())

		------------------
			 1- If the TDM Format used to play in parallel 2 audio Stream (the first Stream is configured in codec SLOT0 and second
					Stream in SLOT1) the Pause/Resume, volume and mute feature will control the both streams.
			 2- Parsing of audio file is not implemented (in order to determine audio file properties: Mono/Stereo, Data size,
					File size, Audio Frequency, Audio Data header size ...). The configuration is fixed for the given audio file.
			 3- Supports only Stereo audio streaming.
			 4- Supports only 16-bits audio data size.
	*/
/*}}}*/
#include "stm32F7_disco_audio.h"

AUDIO_DrvTypeDef* audio_drv;
SAI_HandleTypeDef haudio_out_sai={0};
SAI_HandleTypeDef haudio_in_sai={0};
TIM_HandleTypeDef haudio_tim;
uint16_t __IO AudioInVolume = DEFAULT_AUDIO_IN_VOLUME;

/*{{{*/
/**
	* @brief  Initializes the output Audio Codec audio interface (SAI).
	* @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
	* @note   The default SlotActive configuration is set to CODEC_AUDIOFRAME_SLOT_0123
	*         and user can update this configuration using
	* @retval None
	*/
static void SAIx_Out_Init (uint32_t AudioFreq)
{
	/* Initialize the haudio_out_sai Instance parameter */
	haudio_out_sai.Instance = AUDIO_OUT_SAIx;

	/* Disable SAI peripheral to allow access to SAI internal registers */
	__HAL_SAI_DISABLE(&haudio_out_sai);

	/* Configure SAI_Block_x
	LSBFirst: Disabled
	DataSize: 16 */
	haudio_out_sai.Init.AudioFrequency = AudioFreq;
	haudio_out_sai.Init.AudioMode = SAI_MODEMASTER_TX;
	haudio_out_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLED;
	haudio_out_sai.Init.Protocol = SAI_FREE_PROTOCOL;
	haudio_out_sai.Init.DataSize = SAI_DATASIZE_16;
	haudio_out_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
	haudio_out_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
	haudio_out_sai.Init.Synchro = SAI_ASYNCHRONOUS;
	haudio_out_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLED;
	haudio_out_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;

	/* Configure SAI_Block_x Frame
	Frame Length: 64
	Frame active Length: 32
	FS Definition: Start frame + Channel Side identification
	FS Polarity: FS active Low
	FS Offset: FS asserted one bit before the first bit of slot 0 */
	haudio_out_sai.FrameInit.FrameLength = 64;
	haudio_out_sai.FrameInit.ActiveFrameLength = 32;
	haudio_out_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
	haudio_out_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
	haudio_out_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

	/* Configure SAI Block_x Slot
	Slot First Bit Offset: 0
	Slot Size  : 16
	Slot Number: 4
	Slot Active: All slot actives */
	haudio_out_sai.SlotInit.FirstBitOffset = 0;
	haudio_out_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
	haudio_out_sai.SlotInit.SlotNumber = 4;
	haudio_out_sai.SlotInit.SlotActive = CODEC_AUDIOFRAME_SLOT_0123;

