mafeiGitHub/stm32Mp3/Bsp/stm32F7_disco_audio.c
	HAL_SAI_Init(&haudio_out_sai);

	/* Enable SAI peripheral to generate MCLK */
	__HAL_SAI_ENABLE(&haudio_out_sai);
}
/*}}}*/
/*{{{*/
/**
	* @brief  Deinitializes the output Audio Codec audio interface (SAI).
	* @retval None
	*/
static void SAIx_Out_DeInit()
{
	/* Initialize the haudio_out_sai Instance parameter */
	haudio_out_sai.Instance = AUDIO_OUT_SAIx;

	/* Disable SAI peripheral */
	__HAL_SAI_DISABLE(&haudio_out_sai);

	HAL_SAI_DeInit(&haudio_out_sai);
}
/*}}}*/
/*{{{*/
/**
	* @brief  Initializes the input Audio Codec audio interface (SAI).
	* @param  SaiOutMode: SAI_MODEMASTER_TX (for record and playback in parallel)
	*                     or SAI_MODEMASTER_RX (for record only).
	* @param  SlotActive: CODEC_AUDIOFRAME_SLOT_02 or CODEC_AUDIOFRAME_SLOT_13
	* @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
	* @retval None
	*/
static void SAIx_In_Init (uint32_t SaiOutMode, uint32_t SlotActive, uint32_t AudioFreq)
{
	/* Initialize SAI2 block A in MASTER RX */
	/* Initialize the haudio_out_sai Instance parameter */
	haudio_out_sai.Instance = AUDIO_OUT_SAIx;

	/* Disable SAI peripheral to allow access to SAI internal registers */
	__HAL_SAI_DISABLE(&haudio_out_sai);

	/* Configure SAI_Block_x
	LSBFirst: Disabled
	DataSize: 16 */
	haudio_out_sai.Init.AudioFrequency = AudioFreq;
	haudio_out_sai.Init.AudioMode = SaiOutMode;
	haudio_out_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLED;
	haudio_out_sai.Init.Protocol = SAI_FREE_PROTOCOL;
	haudio_out_sai.Init.DataSize = SAI_DATASIZE_16;
	haudio_out_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
	haudio_out_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
	haudio_out_sai.Init.Synchro = SAI_ASYNCHRONOUS;
	haudio_out_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLED;
	haudio_out_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;

	/* Configure SAI_Block_x Frame
	Frame Length: 64
	Frame active Length: 32
	FS Definition: Start frame + Channel Side identification
	FS Polarity: FS active Low
	FS Offset: FS asserted one bit before the first bit of slot 0 */
	haudio_out_sai.FrameInit.FrameLength = 64;
	haudio_out_sai.FrameInit.ActiveFrameLength = 32;
	haudio_out_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
	haudio_out_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
	haudio_out_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

	/* Configure SAI Block_x Slot
	Slot First Bit Offset: 0
	Slot Size  : 16
	Slot Number: 4
	Slot Active: All slot actives */
	haudio_out_sai.SlotInit.FirstBitOffset = 0;
	haudio_out_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
	haudio_out_sai.SlotInit.SlotNumber = 4;
	haudio_out_sai.SlotInit.SlotActive = SlotActive;

	HAL_SAI_Init(&haudio_out_sai);

	/* Initialize SAI2 block B in SLAVE RX synchronous from SAI2 block A */
	/* Initialize the haudio_in_sai Instance parameter */
	haudio_in_sai.Instance = AUDIO_IN_SAIx;

	/* Disable SAI peripheral to allow access to SAI internal registers */
	__HAL_SAI_DISABLE(&haudio_in_sai);

	/* Configure SAI_Block_x
	LSBFirst: Disabled
	DataSize: 16 */
	haudio_in_sai.Init.AudioFrequency = AudioFreq;
	haudio_in_sai.Init.AudioMode = SAI_MODESLAVE_RX;
	haudio_in_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLED;
	haudio_in_sai.Init.Protocol = SAI_FREE_PROTOCOL;
	haudio_in_sai.Init.DataSize = SAI_DATASIZE_16;
	haudio_in_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
	haudio_in_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
	haudio_in_sai.Init.Synchro = SAI_SYNCHRONOUS;
	haudio_in_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLED;
	haudio_in_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;

	/* Configure SAI_Block_x Frame
	Frame Length: 64
	Frame active Length: 32
	FS Definition: Start frame + Channel Side identification
	FS Polarity: FS active Low
	FS Offset: FS asserted one bit before the first bit of slot 0 */
	haudio_in_sai.FrameInit.FrameLength = 64;
	haudio_in_sai.FrameInit.ActiveFrameLength = 32;
	haudio_in_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
	haudio_in_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
	haudio_in_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

	/* Configure SAI Block_x Slot
	Slot First Bit Offset: 0
	Slot Size  : 16
	Slot Number: 4
	Slot Active: All slot active */
	haudio_in_sai.SlotInit.FirstBitOffset = 0;
	haudio_in_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
	haudio_in_sai.SlotInit.SlotNumber = 4;
	haudio_in_sai.SlotInit.SlotActive = SlotActive;

	HAL_SAI_Init(&haudio_in_sai);

	/* Enable SAI peripheral to generate MCLK */
	__HAL_SAI_ENABLE(&haudio_out_sai);

	/* Enable SAI peripheral */
	__HAL_SAI_ENABLE(&haudio_in_sai);
}
/*}}}*/
/*{{{*/
/**
	* @brief  Deinitializes the output Audio Codec audio interface (SAI).
	* @retval None
	*/
static void SAIx_In_DeInit()
{
	/* Initialize the haudio_in_sai Instance parameter */
	haudio_in_sai.Instance = AUDIO_IN_SAIx;

	/* Disable SAI peripheral */
	__HAL_SAI_DISABLE(&haudio_in_sai);

	HAL_SAI_DeInit(&haudio_in_sai);
}
/*}}}*/

/*{{{*/
/**
	* @brief  Configures the audio peripherals.
	* @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
	*                       or OUTPUT_DEVICE_BOTH.
	* @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
	* @param  AudioFreq: Audio frequency used to play the audio stream.
	* @note   The I2S PLL input clock must be done in the user application.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_OUT_Init (uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
	uint8_t ret = AUDIO_ERROR;
	uint32_t deviceid = 0x00;

	/* Disable SAI */
	SAIx_Out_DeInit();

	/* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
	BSP_AUDIO_OUT_ClockConfig(&haudio_out_sai, AudioFreq, NULL);

	/* SAI data transfer preparation:
	Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
	haudio_out_sai.Instance = AUDIO_OUT_SAIx;
	if(HAL_SAI_GetState(&haudio_out_sai) == HAL_SAI_STATE_RESET)
	{
		/* Init the SAI MSP: this __weak function can be redefined by the application*/
		BSP_AUDIO_OUT_MspInit(&haudio_out_sai, NULL);
	}
	SAIx_Out_Init(AudioFreq);

	/* wm8994 codec initialization */
	deviceid = wm8994_drv.ReadID(AUDIO_I2C_ADDRESS);

	if((deviceid) == WM8994_ID)
	{
		/* Reset the Codec Registers */
		wm8994_drv.Reset(AUDIO_I2C_ADDRESS);
		/* Initialize the audio driver structure */
		audio_drv = &wm8994_drv;
		ret = AUDIO_OK;
	}
	else
	{
		ret = AUDIO_ERROR;
	}

