mafeiGitHub/stm32Mp3/Bsp/stm32F7_disco_audio.c
/*{{{*/
/**
	* @brief  Tx Transfer completed callbacks.
	* @param  hsai: SAI handle
	* @retval None
	*/
void HAL_SAI_TxCpltCallback (SAI_HandleTypeDef* hsai)
{
	/* Manage the remaining file size and new address offset: This function
		 should be coded by user (its prototype is already declared in stm32746g_discovery_audio.h) */
	BSP_AUDIO_OUT_TransferComplete_CallBack();
}
/*}}}*/
/*{{{*/
/**
	* @brief  Tx Half Transfer completed callbacks.
	* @param  hsai: SAI handle
	* @retval None
	*/
void HAL_SAI_TxHalfCpltCallback (SAI_HandleTypeDef* hsai)
{
	/* Manage the remaining file size and new address offset: This function
		 should be coded by user (its prototype is already declared in stm32746g_discovery_audio.h) */
	BSP_AUDIO_OUT_HalfTransfer_CallBack();
}
/*}}}*/
/*{{{*/
/**
	* @brief  SAI error callbacks.
	* @param  hsai: SAI handle
	* @retval None
	*/
void HAL_SAI_ErrorCallback (SAI_HandleTypeDef *hsai)
{
	if(hsai->Instance == AUDIO_OUT_SAIx)
		{
		BSP_AUDIO_OUT_Error_CallBack();
		}
		else
		{
			BSP_AUDIO_IN_Error_CallBack();
		}
}
/*}}}*/
/*{{{*/
/**
	* @brief  Manages the DMA full Transfer complete event.
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_TransferComplete_CallBack()
{
}
/*}}}*/
/*{{{*/
/**
	* @brief  Manages the DMA Half Transfer complete event.
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_HalfTransfer_CallBack()
{
}
/*}}}*/
/*{{{*/
/**
	* @brief  Manages the DMA FIFO error event.
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_Error_CallBack()
{
}
/*}}}*/
/*{{{*/
/**
	* @brief  Initializes BSP_AUDIO_OUT MSP.
	* @param  hsai: SAI handle
	* @param  Params
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_MspInit (SAI_HandleTypeDef *hsai, void *Params)
{
	static DMA_HandleTypeDef hdma_sai_tx;
	GPIO_InitTypeDef  gpio_init_structure;

	/* Enable SAI clock */
	AUDIO_OUT_SAIx_CLK_ENABLE();

	/* Enable GPIO clock */
	AUDIO_OUT_SAIx_MCLK_ENABLE();
	AUDIO_OUT_SAIx_SCK_SD_ENABLE();
	AUDIO_OUT_SAIx_FS_ENABLE();
	/* CODEC_SAI pins configuration: FS, SCK, MCK and SD pins ------------------*/
	gpio_init_structure.Pin = AUDIO_OUT_SAIx_FS_PIN;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;
	gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
	HAL_GPIO_Init(AUDIO_OUT_SAIx_FS_GPIO_PORT, &gpio_init_structure);

	gpio_init_structure.Pin = AUDIO_OUT_SAIx_SCK_PIN;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;
	gpio_init_structure.Alternate = AUDIO_OUT_SAIx_SCK_AF;
	HAL_GPIO_Init(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, &gpio_init_structure);

	gpio_init_structure.Pin =  AUDIO_OUT_SAIx_SD_PIN;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;
	gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
	HAL_GPIO_Init(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, &gpio_init_structure);

	gpio_init_structure.Pin = AUDIO_OUT_SAIx_MCLK_PIN;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;
	gpio_init_structure.Alternate = AUDIO_OUT_SAIx_FS_SD_MCLK_AF;
	HAL_GPIO_Init(AUDIO_OUT_SAIx_MCLK_GPIO_PORT, &gpio_init_structure);

	/* Enable the DMA clock */
	AUDIO_OUT_SAIx_DMAx_CLK_ENABLE();

	if(hsai->Instance == AUDIO_OUT_SAIx)
	{
		/* Configure the hdma_saiTx handle parameters */
		hdma_sai_tx.Init.Channel             = AUDIO_OUT_SAIx_DMAx_CHANNEL;
		hdma_sai_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
		hdma_sai_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
		hdma_sai_tx.Init.MemInc              = DMA_MINC_ENABLE;
		hdma_sai_tx.Init.PeriphDataAlignment = AUDIO_OUT_SAIx_DMAx_PERIPH_DATA_SIZE;
		hdma_sai_tx.Init.MemDataAlignment    = AUDIO_OUT_SAIx_DMAx_MEM_DATA_SIZE;
		hdma_sai_tx.Init.Mode                = DMA_CIRCULAR;
		hdma_sai_tx.Init.Priority            = DMA_PRIORITY_HIGH;
		hdma_sai_tx.Init.FIFOMode            = DMA_FIFOMODE_ENABLE;
		hdma_sai_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
		hdma_sai_tx.Init.MemBurst            = DMA_MBURST_SINGLE;
		hdma_sai_tx.Init.PeriphBurst         = DMA_PBURST_SINGLE;

		hdma_sai_tx.Instance = AUDIO_OUT_SAIx_DMAx_STREAM;

		/* Associate the DMA handle */
		__HAL_LINKDMA(hsai, hdmatx, hdma_sai_tx);

		/* Deinitialize the Stream for new transfer */
		HAL_DMA_DeInit(&hdma_sai_tx);

		/* Configure the DMA Stream */
		HAL_DMA_Init(&hdma_sai_tx);
	}

	/* SAI DMA IRQ Channel configuration */
	HAL_NVIC_SetPriority(AUDIO_OUT_SAIx_DMAx_IRQ, AUDIO_OUT_IRQ_PREPRIO, 0);
	HAL_NVIC_EnableIRQ(AUDIO_OUT_SAIx_DMAx_IRQ);
}
/*}}}*/
/*{{{*/
/**
	* @brief  Deinitializes SAI MSP.
	* @param  hsai: SAI handle
	* @param  Params
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_MspDeInit (SAI_HandleTypeDef *hsai, void *Params)
{
		GPIO_InitTypeDef  gpio_init_structure;

		/* SAI DMA IRQ Channel deactivation */
		HAL_NVIC_DisableIRQ(AUDIO_OUT_SAIx_DMAx_IRQ);

		if(hsai->Instance == AUDIO_OUT_SAIx)
		{
			/* Deinitialize the DMA stream */
			HAL_DMA_DeInit(hsai->hdmatx);
		}

		/* Disable SAI peripheral */
		__HAL_SAI_DISABLE(hsai);

		/* Deactives CODEC_SAI pins FS, SCK, MCK and SD by putting them in input mode */
		gpio_init_structure.Pin = AUDIO_OUT_SAIx_FS_PIN;
		HAL_GPIO_DeInit(AUDIO_OUT_SAIx_FS_GPIO_PORT, gpio_init_structure.Pin);

		gpio_init_structure.Pin = AUDIO_OUT_SAIx_SCK_PIN;
		HAL_GPIO_DeInit(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, gpio_init_structure.Pin);

		gpio_init_structure.Pin =  AUDIO_OUT_SAIx_SD_PIN;
		HAL_GPIO_DeInit(AUDIO_OUT_SAIx_SCK_SD_GPIO_PORT, gpio_init_structure.Pin);

		gpio_init_structure.Pin = AUDIO_OUT_SAIx_MCLK_PIN;
		HAL_GPIO_DeInit(AUDIO_OUT_SAIx_MCLK_GPIO_PORT, gpio_init_structure.Pin);

		/* Disable SAI clock */
		AUDIO_OUT_SAIx_CLK_DISABLE();

		/* GPIO pins clock and DMA clock can be shut down in the application
			 by surcharging this __weak function */
}
/*}}}*/
/*{{{*/
/**
	* @brief  Clock Config.
	* @param  hsai: might be required to set audio peripheral predivider if any.
	* @param  AudioFreq: Audio frequency used to play the audio stream.
	* @param  Params
	* @note   This API is called by BSP_AUDIO_OUT_Init() and BSP_AUDIO_OUT_SetFrequency()
	*         Being __weak it can be overwritten by the application
	* @retval None
	*/
__weak void BSP_AUDIO_OUT_ClockConfig (SAI_HandleTypeDef *hsai, uint32_t AudioFreq, void *Params)
{
	RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;

