mafeiGitHub/stm32Mp3/Bsp/stm32F7_disco_audio.c
	HAL_RCCEx_GetPeriphCLKConfig(&rcc_ex_clk_init_struct);

	/* Set the PLL configuration according to the audio frequency */
	if((AudioFreq == AUDIO_FREQUENCY_11K) || (AudioFreq == AUDIO_FREQUENCY_22K) || (AudioFreq == AUDIO_FREQUENCY_44K))
	{
		/* Configure PLLI2S prescalers */
		/* PLLI2S_VCO: VCO_429M
		I2S_CLK(first level) = PLLI2S_VCO/PLLI2SQ = 429/2 = 214.5 Mhz
		I2S_CLK_x = I2S_CLK(first level)/PLLI2SDIVQ = 214.5/19 = 11.289 Mhz */
		rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
		rcc_ex_clk_init_struct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
		rcc_ex_clk_init_struct.PLLI2S.PLLI2SN = 429;
		rcc_ex_clk_init_struct.PLLI2S.PLLI2SQ = 2;
		rcc_ex_clk_init_struct.PLLI2SDivQ = 19;

		HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct);

	}
	else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_48K), AUDIO_FREQUENCY_96K */
	{
		/* I2S clock config
		PLLI2S_VCO: VCO_344M
		I2S_CLK(first level) = PLLI2S_VCO/PLLI2SQ = 344/7 = 49.142 Mhz
		I2S_CLK_x = I2S_CLK(first level)/PLLI2SDIVQ = 49.142/1 = 49.142 Mhz */
		rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
		rcc_ex_clk_init_struct.Sai2ClockSelection = RCC_SAI2CLKSOURCE_PLLI2S;
		rcc_ex_clk_init_struct.PLLI2S.PLLI2SN = 344;
		rcc_ex_clk_init_struct.PLLI2S.PLLI2SQ = 7;
		rcc_ex_clk_init_struct.PLLI2SDivQ = 1;

		HAL_RCCEx_PeriphCLKConfig(&rcc_ex_clk_init_struct);
	}
}
/*}}}*/

/*{{{*/
/**
	* @brief  Initializes wave recording.
	* @param  InputDevice: INPUT_DEVICE_DIGITAL_MICROPHONE_2 or INPUT_DEVICE_INPUT_LINE_1
	* @param  Volume: Initial volume level (in range 0(Mute)..80(+0dB)..100(+17.625dB))
	* @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_Init (uint16_t InputDevice, uint8_t Volume, uint32_t AudioFreq)
{
	uint8_t ret = AUDIO_ERROR;
	uint32_t deviceid = 0x00;
	uint32_t slot_active;

	if ((InputDevice != INPUT_DEVICE_INPUT_LINE_1) &&       /* Only INPUT_LINE_1 and MICROPHONE_2 inputs supported */
			(InputDevice != INPUT_DEVICE_DIGITAL_MICROPHONE_2))
	{
		ret = AUDIO_ERROR;
	}
	else
	{
		/* Disable SAI */
		SAIx_In_DeInit();

		/* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
		BSP_AUDIO_OUT_ClockConfig(&haudio_in_sai, AudioFreq, NULL); /* Clock config is shared between AUDIO IN and OUT */

		/* SAI data transfer preparation:
		Prepare the Media to be used for the audio transfer from SAI peripheral to memory */
		haudio_in_sai.Instance = AUDIO_IN_SAIx;
		if(HAL_SAI_GetState(&haudio_in_sai) == HAL_SAI_STATE_RESET)
		{
			/* Init the SAI MSP: this __weak function can be redefined by the application*/
			BSP_AUDIO_OUT_MspInit(&haudio_in_sai, NULL);  /* Initialize GPIOs for SAI2 block A Master signals */
			BSP_AUDIO_IN_MspInit(&haudio_in_sai, NULL);
		}

		/* Configure SAI in master RX mode :
		 *   - SAI2_block_A in master RX mode
		 *   - SAI2_block_B in slave RX mode synchronous from SAI2_block_A
		 */
		if (InputDevice == INPUT_DEVICE_DIGITAL_MICROPHONE_2)
		{
			slot_active = CODEC_AUDIOFRAME_SLOT_13;
		}
		else
		{
			slot_active = CODEC_AUDIOFRAME_SLOT_02;
		}
		SAIx_In_Init(SAI_MODEMASTER_RX, slot_active, AudioFreq);

		/* wm8994 codec initialization */
		deviceid = wm8994_drv.ReadID(AUDIO_I2C_ADDRESS);

		if((deviceid) == WM8994_ID)
		{
			/* Reset the Codec Registers */
			wm8994_drv.Reset(AUDIO_I2C_ADDRESS);
			/* Initialize the audio driver structure */
			audio_drv = &wm8994_drv;
			ret = AUDIO_OK;
		}
		else
		{
			ret = AUDIO_ERROR;
		}

		if(ret == AUDIO_OK)
		{
			/* Initialize the codec internal registers */
			audio_drv->Init(AUDIO_I2C_ADDRESS, InputDevice, Volume, AudioFreq);
		}
	}
	return ret;
}
/*}}}*/
/*{{{*/
/**
	* @brief  Initializes wave recording and playback in parallel.
	* @param  InputDevice: INPUT_DEVICE_DIGITAL_MICROPHONE_2
	* @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
	*                       or OUTPUT_DEVICE_BOTH.
	* @param  Volume: Initial volume level (in range 0(Mute)..80(+0dB)..100(+17.625dB))
	* @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_OUT_Init (uint16_t InputDevice, uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
	uint8_t ret = AUDIO_ERROR;
	uint32_t deviceid = 0x00;
	uint32_t slot_active;

	if (InputDevice != INPUT_DEVICE_DIGITAL_MICROPHONE_2)  /* Only MICROPHONE_2 input supported */
	{
		ret = AUDIO_ERROR;
	}
	else
	{
		/* Disable SAI */
		SAIx_In_DeInit();
		SAIx_Out_DeInit();

		/* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
		BSP_AUDIO_OUT_ClockConfig(&haudio_in_sai, AudioFreq, NULL); /* Clock config is shared between AUDIO IN and OUT */

		/* SAI data transfer preparation:
		Prepare the Media to be used for the audio transfer from SAI peripheral to memory */
		haudio_in_sai.Instance = AUDIO_IN_SAIx;
		if(HAL_SAI_GetState(&haudio_in_sai) == HAL_SAI_STATE_RESET)
		{
			/* Init the SAI MSP: this __weak function can be redefined by the application*/
			BSP_AUDIO_IN_MspInit(&haudio_in_sai, NULL);
		}

		/* SAI data transfer preparation:
		Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
		haudio_out_sai.Instance = AUDIO_OUT_SAIx;
		if(HAL_SAI_GetState(&haudio_out_sai) == HAL_SAI_STATE_RESET)
		{
			/* Init the SAI MSP: this __weak function can be redefined by the application*/
			BSP_AUDIO_OUT_MspInit(&haudio_out_sai, NULL);
		}

		/* Configure SAI in master mode :
		 *   - SAI2_block_A in master TX mode
		 *   - SAI2_block_B in slave RX mode synchronous from SAI2_block_A
		 */
		if (InputDevice == INPUT_DEVICE_DIGITAL_MICROPHONE_2)
		{
			slot_active = CODEC_AUDIOFRAME_SLOT_13;
		}
		else
		{
			slot_active = CODEC_AUDIOFRAME_SLOT_02;
		}
		SAIx_In_Init(SAI_MODEMASTER_TX, slot_active, AudioFreq);

		/* wm8994 codec initialization */
		deviceid = wm8994_drv.ReadID(AUDIO_I2C_ADDRESS);

		if((deviceid) == WM8994_ID)
		{
			/* Reset the Codec Registers */
			wm8994_drv.Reset(AUDIO_I2C_ADDRESS);
			/* Initialize the audio driver structure */
			audio_drv = &wm8994_drv;
			ret = AUDIO_OK;
		}
		else
		{
			ret = AUDIO_ERROR;
		}

