mafeiGitHub/stm32Mp3/Bsp/stm32F7_disco_audio.c
		if(ret == AUDIO_OK)
		{
			/* Initialize the codec internal registers */
			audio_drv->Init(AUDIO_I2C_ADDRESS, InputDevice | OutputDevice, Volume, AudioFreq);
		}
	}
	return ret;
}
/*}}}*/
/*{{{*/
/**
	* @brief  Starts audio recording.
	* @param  pbuf: Main buffer pointer for the recorded data storing
	* @param  size: size of the recorded buffer in number of elements (typically number of half-words)
	*               Be careful that it is not the same unit than BSP_AUDIO_OUT_Play function
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t  BSP_AUDIO_IN_Record (uint16_t* pbuf, uint32_t size)
{
	uint32_t ret = AUDIO_ERROR;

	/* Start the process receive DMA */
	HAL_SAI_Receive_DMA(&haudio_in_sai, (uint8_t*)pbuf, size);

	/* Return AUDIO_OK when all operations are correctly done */
	ret = AUDIO_OK;

	return ret;
}
/*}}}*/
/*{{{*/
/**
	* @brief  Stops audio recording.
	* @param  Option: could be one of the following parameters
	*           - CODEC_PDWN_SW: for software power off (by writing registers).
	*                            Then no need to reconfigure the Codec after power on.
	*           - CODEC_PDWN_HW: completely shut down the codec (physically).
	*                            Then need to reconfigure the Codec after power on.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_Stop (uint32_t Option)
{
	/* Call the Media layer stop function */
	HAL_SAI_DMAStop(&haudio_in_sai);

	/* Call Audio Codec Stop function */
	if(audio_drv->Stop(AUDIO_I2C_ADDRESS, Option) != 0)
	{
		return AUDIO_ERROR;
	}
	else
	{
		if(Option == CODEC_PDWN_HW)
		{
			/* Wait at least 100us */
			HAL_Delay(1);
		}
		/* Return AUDIO_OK when all operations are correctly done */
		return AUDIO_OK;
	}
}
/*}}}*/
/*{{{*/
/**
	* @brief  Pauses the audio file stream.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_Pause()
{
	/* Call the Media layer pause function */
	HAL_SAI_DMAPause(&haudio_in_sai);
	/* Return AUDIO_OK when all operations are correctly done */
	return AUDIO_OK;
}
/*}}}*/
/*{{{*/
/**
	* @brief  Resumes the audio file stream.
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_Resume()
{
	/* Call the Media layer pause/resume function */
	HAL_SAI_DMAResume(&haudio_in_sai);
	/* Return AUDIO_OK when all operations are correctly done */
	return AUDIO_OK;
}
/*}}}*/
/*{{{*/
/**
	* @brief  Controls the audio in volume level.
	* @param  Volume: Volume level in range 0(Mute)..80(+0dB)..100(+17.625dB)
	* @retval AUDIO_OK if correct communication, else wrong communication
	*/
uint8_t BSP_AUDIO_IN_SetVolume (uint8_t Volume)
{
	/* Call the codec volume control function with converted volume value */
	if(audio_drv->SetVolume(AUDIO_I2C_ADDRESS, Volume) != 0)
	{
		return AUDIO_ERROR;
	}
	else
	{
		/* Set the Global variable AudioInVolume  */
		AudioInVolume = Volume;
		/* Return AUDIO_OK when all operations are correctly done */
		return AUDIO_OK;
	}
}
/*}}}*/
/*{{{*/
/**
	* @brief  Deinit the audio IN peripherals.
	* @retval None
	*/
void BSP_AUDIO_IN_DeInit()
{
	SAIx_In_DeInit();
	/* DeInit the SAI MSP : this __weak function can be rewritten by the application */
	BSP_AUDIO_IN_MspDeInit(&haudio_in_sai, NULL);
}
/*}}}*/

/*{{{*/
 /**
	* @brief  Rx Transfer completed callbacks.
	* @param  hsai: SAI handle
	* @retval None
	*/
void HAL_SAI_RxCpltCallback (SAI_HandleTypeDef* hsai)
{
	/* Call the record update function to get the next buffer to fill and its size (size is ignored) */
	BSP_AUDIO_IN_TransferComplete_CallBack();
}
/*}}}*/
/*{{{*/
/**
	* @brief  Rx Half Transfer completed callbacks.
	* @param  hsai: SAI handle
	* @retval None
	*/
void HAL_SAI_RxHalfCpltCallback (SAI_HandleTypeDef* hsai)
{
	/* Manage the remaining file size and new address offset: This function
		 should be coded by user (its prototype is already declared in stm32746g_discovery_audio.h) */
	BSP_AUDIO_IN_HalfTransfer_CallBack();
}
/*}}}*/
/*{{{*/
/**
	* @brief  User callback when record buffer is filled.
	* @retval None
	*/
__weak void BSP_AUDIO_IN_TransferComplete_CallBack()
{
	/* This function should be implemented by the user application.
		 It is called into this driver when the current buffer is filled
		 to prepare the next buffer pointer and its size. */
}
/*}}}*/
/*{{{*/
/**
	* @brief  Manages the DMA Half Transfer complete event.
	* @retval None
	*/
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack()
{
	/* This function should be implemented by the user application.
		 It is called into this driver when the current buffer is filled
		 to prepare the next buffer pointer and its size. */
}
/*}}}*/
/*{{{*/
/**
	* @brief  Audio IN Error callback function.
	* @retval None
	*/
__weak void BSP_AUDIO_IN_Error_CallBack()
{
	/* This function is called when an Interrupt due to transfer error on or peripheral
		 error occurs. */
}
/*}}}*/
/*{{{*/
/**
	* @brief  Initializes BSP_AUDIO_IN MSP.
	* @param  hsai: SAI handle
	* @param  Params
	* @retval None
	*/
__weak void BSP_AUDIO_IN_MspInit (SAI_HandleTypeDef *hsai, void *Params)
{
	static DMA_HandleTypeDef hdma_sai_rx;
	GPIO_InitTypeDef  gpio_init_structure;

	/* Enable SAI clock */
	AUDIO_IN_SAIx_CLK_ENABLE();

	/* Enable SD GPIO clock */
	AUDIO_IN_SAIx_SD_ENABLE();
	/* CODEC_SAI pin configuration: SD pin */
	gpio_init_structure.Pin = AUDIO_IN_SAIx_SD_PIN;
	gpio_init_structure.Mode = GPIO_MODE_AF_PP;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_FAST;
	gpio_init_structure.Alternate = AUDIO_IN_SAIx_SD_AF;
	HAL_GPIO_Init(AUDIO_IN_SAIx_SD_GPIO_PORT, &gpio_init_structure);

	/* Enable Audio INT GPIO clock */
	AUDIO_IN_INT_GPIO_ENABLE();
	/* Audio INT pin configuration: input */
	gpio_init_structure.Pin = AUDIO_IN_INT_GPIO_PIN;
	gpio_init_structure.Mode = GPIO_MODE_INPUT;
	gpio_init_structure.Pull = GPIO_NOPULL;
	gpio_init_structure.Speed = GPIO_SPEED_FAST;
	HAL_GPIO_Init(AUDIO_IN_INT_GPIO_PORT, &gpio_init_structure);

	/* Enable the DMA clock */
	AUDIO_IN_SAIx_DMAx_CLK_ENABLE();

	if(hsai->Instance == AUDIO_IN_SAIx)
	{
		/* Configure the hdma_sai_rx handle parameters */
		hdma_sai_rx.Init.Channel             = AUDIO_IN_SAIx_DMAx_CHANNEL;
		hdma_sai_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
		hdma_sai_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
		hdma_sai_rx.Init.MemInc              = DMA_MINC_ENABLE;
		hdma_sai_rx.Init.PeriphDataAlignment = AUDIO_IN_SAIx_DMAx_PERIPH_DATA_SIZE;
		hdma_sai_rx.Init.MemDataAlignment    = AUDIO_IN_SAIx_DMAx_MEM_DATA_SIZE;
		hdma_sai_rx.Init.Mode                = DMA_CIRCULAR;
		hdma_sai_rx.Init.Priority            = DMA_PRIORITY_HIGH;
		hdma_sai_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
		hdma_sai_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
		hdma_sai_rx.Init.MemBurst            = DMA_MBURST_SINGLE;
		hdma_sai_rx.Init.PeriphBurst         = DMA_MBURST_SINGLE;

		hdma_sai_rx.Instance = AUDIO_IN_SAIx_DMAx_STREAM;

		/* Associate the DMA handle */
		__HAL_LINKDMA(hsai, hdmarx, hdma_sai_rx);

		/* Deinitialize the Stream for new transfer */
		HAL_DMA_DeInit(&hdma_sai_rx);

		/* Configure the DMA Stream */
		HAL_DMA_Init(&hdma_sai_rx);
	}

	/* SAI DMA IRQ Channel configuration */
	HAL_NVIC_SetPriority(AUDIO_IN_SAIx_DMAx_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
	HAL_NVIC_EnableIRQ(AUDIO_IN_SAIx_DMAx_IRQ);

	/* Audio INT IRQ Channel configuration */
	HAL_NVIC_SetPriority(AUDIO_IN_INT_IRQ, AUDIO_IN_IRQ_PREPRIO, 0);
	HAL_NVIC_EnableIRQ(AUDIO_IN_INT_IRQ);
}
/*}}}*/
/*{{{*/
/**
	* @brief  DeInitializes BSP_AUDIO_IN MSP.
	* @param  hsai: SAI handle
	* @param  Params
	* @retval None
	*/
__weak void BSP_AUDIO_IN_MspDeInit (SAI_HandleTypeDef *hsai, void *Params)
{
	GPIO_InitTypeDef  gpio_init_structure;

	static DMA_HandleTypeDef hdma_sai_rx;

	/* SAI IN DMA IRQ Channel deactivation */
	HAL_NVIC_DisableIRQ(AUDIO_IN_SAIx_DMAx_IRQ);

	if(hsai->Instance == AUDIO_IN_SAIx)
	{
		/* Deinitialize the Stream for new transfer */
		HAL_DMA_DeInit(&hdma_sai_rx);
	}

 /* Disable SAI block */
	__HAL_SAI_DISABLE(hsai);

	/* Disable pin: SD pin */
	gpio_init_structure.Pin = AUDIO_IN_SAIx_SD_PIN;
	HAL_GPIO_DeInit(AUDIO_IN_SAIx_SD_GPIO_PORT, gpio_init_structure.Pin);

	/* Disable SAI clock */
	AUDIO_IN_SAIx_CLK_DISABLE();

	/* GPIO pins clock and DMA clock can be shut down in the application
		 by surcharging this __weak function */
}
/*}}}*/
